DeviceIOBinding.SetVideoSourceConfiguration.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:xmime="http://tempuri.org/xmime.xsd"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
    xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2"
    xmlns:tas="http://www.onvif.org/ver10/advancedsecurity/wsdl"
    xmlns:tdn="http://www.onvif.org/ver10/network/wsdl"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl"
    xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <tmd:SetVideoSourceConfiguration>
    <tmd:Configuration ViewMode="" token="">
     <tt:Name></tt:Name>
     <tt:UseCount>0</tt:UseCount>
     <tt:SourceToken></tt:SourceToken>
     <tt:Bounds x="0" y="0" width="0" height="0">
     </tt:Bounds>
     <tt:Extension>
      <tt:Rotate>
       <tt:Mode>OFF</tt:Mode>
       <tt:Degree>0</tt:Degree>
       <tt:Extension>
       </tt:Extension>
      </tt:Rotate>
      <tt:Extension>
       <tt:LensDescription FocalLength="0.0">
        <tt:Offset x="0.0" y="0.0">
        </tt:Offset>
        <tt:Projection>
         <tt:Angle>0.0</tt:Angle>
         <tt:Radius>0.0</tt:Radius>
        </tt:Projection>
        <tt:XFactor>0.0</tt:XFactor>
       </tt:LensDescription>
       <tt:SceneOrientation>
        <tt:Mode>MANUAL</tt:Mode>
        <tt:Orientation></tt:Orientation>
       </tt:SceneOrientation>
      </tt:Extension>
     </tt:Extension>
    </tmd:Configuration>
    <tmd:ForcePersistence>false</tmd:ForcePersistence>
   </tmd:SetVideoSourceConfiguration>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
